hrshygoodness/Luminary-Micro-Library/boards/ek-lm4f232/usb_dev_keyboard/usb_dev_keyboard.c
        //
        // Assume that the bus is not currently suspended if we have just been
        // configured.
        //
        bLastSuspend = false;

        //
        // Keep transferring characters from the UART to the USB host for as
        // long as we are connected to the host.
        //
        while(g_bConnected)
        {
            //
            // Remember the current time.
            //
            ulLastTickCount = g_ulSysTickCount;

            //
            // Has the suspend state changed since last time we checked?
            //
            if(bLastSuspend != g_bSuspended)
            {
                //
                // Yes - the state changed so update the display.
                //
                bLastSuspend = g_bSuspended;
                if(bLastSuspend)
                {
                    GrStringDrawCentered(&sContext, "      Bus      ", -1,
                                         lCenterX, 22, 1);
                    GrStringDrawCentered(&sContext, " suspended ... ", -1,
                                         lCenterX, 32, 1);
                }
                else
                {
                    GrStringDrawCentered(&sContext, "     Host     ", -1,
                                         lCenterX, 22, 1);
                    GrStringDrawCentered(&sContext, " connected ... ",
                                         -1, lCenterX, 32, 1);
                }
            }

            //
            // See if the button was just pressed.
            //
            ucButtons = ButtonsPoll(&ucButtonsChanged, 0);
            if(BUTTON_PRESSED(SELECT_BUTTON, ucButtons, ucButtonsChanged))
            {
                //
                // If the bus is suspended then resume it.  Otherwise, type
                // some "random" characters.
                //
                if(g_bSuspended)
                {
                    USBDHIDKeyboardRemoteWakeupRequest(
                                                   (void *)&g_sKeyboardDevice);
                }
                else
                {
                    SendString("Make the Switch to TI Microcontrollers!");
                }
            }

            //
            // Wait for at least 1 system tick to have gone by before we poll
            // the buttons again.
            //
            while(g_ulSysTickCount == ulLastTickCount)
            {
            }
        }
    }
}
